Repository: xcv58/MacTools
Catalog: Plugins/ActivityBar/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# settings.inputMonitoring.footnote
source: 键盘、鼠标和滚动统计需要在系统设置中允许 MacTools 进行输入监控。前台应用使用时长仍可记录。
ar: تتطلب إحصائيات لوحة المفاتيح والماوس والتمرير السماح بـ MacTools في مراقبة الإدخال. لا يزال من الممكن تسجيل وقت استخدام التطبيق الأمامي.
de: Tastatur-, Maus- und Scroll-Statistiken erfordern die Zulassung von MacTools in der Eingabeüberwachung. Die Nutzungsdauer der Vordergrund-App kann weiterhin aufgezeichnet werden.
en: Keyboard, mouse, and scroll stats require allowing MacTools in Input Monitoring. Foreground app usage time can still be recorded.
es: Las estadísticas de teclado, mouse y desplazamiento requieren permitir MacTools en Monitoreo de entrada. Aún se puede registrar el tiempo de uso de la aplicación en primer plano.
fr: Les statistiques du clavier, de la souris et du défilement nécessitent l'autorisation de MacTools dans la surveillance des entrées. Le temps d'utilisation de l'application au premier plan peut toujours être enregistré.
ja: キーボード、マウス、およびスクロールの統計情報を使用するには、入力モニタリングで MacTools を許可する必要があります。フォアグラウンド アプリの使用時間は引き続き記録できます。
ko: 키보드, 마우스 및 스크롤 통계를 사용하려면 입력 모니터링에서 MacTools을 허용해야 합니다. 포그라운드 앱 사용 시간은 계속 기록될 수 있습니다.
pt: As estatísticas de teclado, mouse e rolagem exigem a permissão de MacTools no monitoramento de entrada. O tempo de uso do app em primeiro plano ainda pode ser registrado.
ru: Статистика клавиатуры, мыши и прокрутки требует разрешения MacTools в мониторинге ввода. Время использования приложений переднего плана по-прежнему можно записать.
tr: Klavye, fare ve kaydırma istatistikleri için Giriş İzleme'de MacTools'a izin vermeniz gerekir. Ön plan uygulaması kullanım süresi yine de kaydedilebilir.
zh_hant: 鍵盤、滑鼠和滾動統計需要在系統設定中允許 MacTools 進行輸入監控。前臺應用使用時長仍可記錄。

# settings.inputMonitoring.title
source: 输入监控
ar: مراقبة الإدخال
de: Eingabeüberwachung
en: Input Monitoring
es: Monitoreo de entrada
fr: Surveillance des entrées
ja: 入力モニタリング
ko: 입력 모니터링
pt: Monitoramento de entrada
ru: Мониторинг ввода
tr: Giriş İzleme
zh_hant: 輸入監控

# status.disabled
source: 未开启
ar: إيقاف
de: Aus
en: Off
es: Desactivado
fr: Désactivé
ja: オフ
ko: 끄기
pt: Desligado
ru: Выкл.
tr: Kapalı
zh_hant: 未開啟

# status.permissionRequired
source: 需要授权
ar: الإذن مطلوب
de: Berechtigung erforderlich
en: Permission Required
es: Permiso requerido
fr: Autorisation requise
ja: 許可が必要です
ko: 권한 필요
pt: Permissão necessária
ru: Требуется разрешение
tr: İzin Gerekli
zh_hant: 需要授權

# status.running
source: 运行中
ar: الجري
de: Läuft
en: Running
es: Corriendo
fr: En cours d'exécution
ja: 実行中
ko: 달리기
pt: Correndo
ru: Бег
tr: Çalışıyor
zh_hant: 運行中

# component.footer.uninstallHooks
source: 卸载 Hook
ar: إزالة الخطافات
de: Hooks deinstallieren
en: Uninstall Hooks
es: Desinstalar hooks
fr: Désinstaller les hooks
ja: Hooks をアンインストール
ko: Hook 제거
pt: Desinstalar hooks
ru: Удалить хуки
tr: Hook'ları Kaldır
zh_hant: 解除安裝 Hook

# panel.action.uninstallHooks
source: 卸载 AI Hook
ar: إزالة خطافات الذكاء الاصطناعي
de: KI-Hooks deinstallieren
en: Uninstall AI Hooks
es: Desinstalar hooks de IA
fr: Désinstaller les hooks IA
ja: AI Hook をアンインストール
ko: AI Hook 제거
pt: Desinstalar hooks de IA
ru: Удалить AI-хуки
tr: Yapay Zekâ Hook'larını Kaldır
zh_hant: 解除安裝 AI Hook

# settings.aiHooks.uninstallButton
source: 卸载 Hook
ar: إزالة الخطافات
de: Hooks deinstallieren
en: Uninstall Hooks
es: Desinstalar hooks
fr: Désinstaller les hooks
ja: Hooks をアンインストール
ko: Hook 제거
pt: Desinstalar hooks
ru: Удалить хуки
tr: Hook'ları Kaldır
zh_hant: 解除安裝 Hook

# settings.aiHooks.uninstallFootnote
source: 只移除 MacTools 写入的 Hook 条目和脚本，不会清空其他工具配置。
ar: يزيل فقط إدخالات Hooks والبرامج النصية التي كتبها MacTools؛ ولا يمس إعدادات الأدوات الأخرى.
de: Entfernt nur von MacTools geschriebene Hook-Einträge und Skripte; Konfigurationen anderer Tools bleiben erhalten.
en: Only removes Hook entries and scripts written by MacTools; other tool configurations remain unchanged.
es: Solo elimina las entradas y los scripts de hooks escritos por MacTools; las configuraciones de otras herramientas no cambian.
fr: Supprime uniquement les entrées et scripts de hooks écrits par MacTools ; les configurations des autres outils restent inchangées.
ja: MacTools が書き込んだ Hook の項目とスクリプトだけを削除し、ほかのツールの設定は変更しません。
ko: MacTools가 작성한 Hook 항목과 스크립트만 제거하며 다른 도구의 설정은 유지합니다.
pt: Remove apenas as entradas e os scripts de hooks gravados pelo MacTools; as configurações de outras ferramentas permanecem inalteradas.
ru: Удаляет только записи и сценарии хуков, созданные MacTools; настройки других инструментов не затрагиваются.
tr: Yalnızca MacTools'un yazdığı Hook girdilerini ve betiklerini kaldırır; diğer araç yapılandırmaları değişmez.
zh_hant: 只移除 MacTools 寫入的 Hook 項目和指令碼，不會清空其他工具設定。
